app/views/restaurantes/show.html.erb

<b> Nota média: </b>
<%= @restaurante.qualificacoes.average(:nota) %><br />
---
SELECT `qualificacoes`.* FROM `qualificacoes` WHERE `qualificacoes`.`restaurante_id` = 1