app/controllers/clientes_controller.rb

SELECT `clientes`.* FROM `clientes`
---
  def index
    @clientes = Cliente.all

SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1
---
  def show
    @cliente = Cliente.find(params[:id])

SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1
---
  def edit
    @cliente = Cliente.find(params[:id])

INSERT INTO `clientes` (`created_at`, `idade`, `nome`, `updated_at`) VALUES ('2012-12-12 19:18:26', 17, 'victor', '2012-12-12 19:18:26')
---
  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save

SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 3 LIMIT 1
UPDATE `clientes` SET `nome` = 'Bruno Freitas', `idade` = 35, `updated_at` = '2012-12-21 19:41:59' WHERE `clientes`.`id` = 4
---
  def update
    @cliente = Cliente.find(params[:id])

    respond_to do |format|
      if @cliente.update_attributes(params[:cliente])