app/controllers/comentarios_controller.rb

SELECT `comentarios`.* FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1
---
  def show
    @comentario = Comentario.find(params[:id])

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1
---
  def edit
    @comentario = Comentario.find(params[:id])

INSERT INTO `comentarios` (`comentavel_id`, `comentavel_type`, `conteudo`, `created_at`, `updated_at`) VALUES (0, 'texto', 'Depois de algum tempo você aprende a diferença, a sutil diferença entre dar a mão e acorrentar uma alma\r\nWillian Shakespeare', '2012-12-13 18:04:01', '2012-12-13 18:04:01')
---
  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      @comentario.save

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1
UPDATE `comentarios` SET `conteudo` = '\"Depois de algum tempo você aprende a diferença, a sutil diferença entre dar a mão e acorrentar uma alma\"\r\nWillian Shakespeare', `updated_at` = '2012-12-13 18:05:28' WHERE `comentarios`.`id` = 1
---
  def update
    @comentario = Comentario.find(params[:id])

    respond_to do |format|
      if @comentario.update_attributes(params[:comentario])

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 2 LIMIT 1
DELETE FROM `comentarios` WHERE `comentarios`.`id` = 2
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy