app/controllers/qualificacoes_controller.rb

  def new
    @qualificacao = Qualificacao.new
    if  params[:cliente]
      @qualificacao.cliente = Cliente.find(params[:cliente])
    end
    if params[:restaurante]
      @qualificacao.restaurante = Restaurante.find(params[:restaurante])
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 3 LIMIT 1
SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 4 LIMIT 1