app/controllers/restaurantes_controller.rb

	def index
		@restaurantes = Restaurante.order("nome").page(params['page']).per(3)
---
SELECT COUNT(*) FROM `restaurantes`
SELECT `restaurantes`.* FROM `restaurantes` ORDER BY nome LIMIT 3 OFFSET 0

	def show
		@restaurante  = Restaurante.find(params[:id])
---
SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 4 LIMIT 1

def edit
	@restaurante = Restaurante.find(params[:id])
---
SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 4 LIMIT 1

def update
	@restaurante = Restaurante.find(params[:id])
	if @restaurante.update_attributes(params[:restaurante])
---
SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 4 LIMIT 1
UPDATE `restaurantes` SET `nome` = 'Apple Bees', `endereco` = 'Rua das Ameixeiras', `especialidade` = 'Comida Norte americana', `updated_at` = '2012-12-21 16:42:18' WHERE `restaurantes`.`id` = 8

	def destroy
		@restaurante = Restaurante.find(params[:id])
		@restaurante.destroy
---
SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 4 LIMIT 1
DELETE FROM `restaurantes` WHERE `restaurantes`.`id` = 4